# Проверялка чисел.
# Пользователь вводит три целых значения.
# Программа проверяет, что a*c==c
# Если проверка пройдена - Ура, иначе - Фу

a = int(input('введите целое число 1-е '))
b = int(input('введите целое число 2-е '))
c = int(input('введите целое число 3-е '))

if a * b == c :
    print("Ура")
else:
    print("Фу")

